NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* DUV3 @Bit 27 : Data unit valid info. */
  #define CACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)     /*!< Position of DUV3 field.                                              */
  #define CACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << CACHEINFO_SET_WAY_INFO_DUV3_Pos) /*!< Bit mask of DUV3 field.              */
  #define CACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)    /*!< Min enumerator value of DUV3 field.                                  */
  #define CACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)    /*!< Max enumerator value of DUV3 field.                                  */
  #define CACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL) /*!< Invalid data unit                                                   */
  #define CACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL)  /*!< Valid data unit                                                      */

/* V @Bit 30 : Line valid bit. */
  #define CACHEINFO_SET_WAY_INFO_V_Pos (30UL)        /*!< Position of V field.                                                 */
  #define CACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << CACHEINFO_SET_WAY_INFO_V_Pos) /*!< Bit mask of V field.                       */
  #define CACHEINFO_SET_WAY_INFO_V_Min (0x0UL)       /*!< Min enumerator value of V field.                                     */
  #define CACHEINFO_SET_WAY_INFO_V_Max (0x1UL)       /*!< Max enumerator value of V field.                                     */
  #define CACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL)   /*!< Invalid cache line                                                   */
  #define CACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)     /*!< Valid cache line                                                     */

/* MRU @Bit 31 : Most recently used way. */
  #define CACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)      /*!< Position of MRU field.                                               */
  #define CACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << CACHEINFO_SET_WAY_INFO_MRU_Pos) /*!< Bit mask of MRU field.                 */
  #define CACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)     /*!< Min enumerator value of MRU field.                                   */
  #define CACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)     /*!< Max enumerator value of MRU field.                                   */
  #define CACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)    /*!< Way0 was most recently used                                          */
  #define CACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)    /*!< Way1 was most recently used                                          */



/* ================================================== Struct CACHEINFO_SET =================================================== */
/**
  * @brief SET [CACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_CACHEINFO_SET_WAY_Type WAY[2];           /*!< (@ 0x00000000) (unspecified)                                         */
} NRF_CACHEINFO_SET_Type;                            /*!< Size = 8 (0x008)                                                     */
  #define CACHEINFO_SET_MaxCount (128UL)             /*!< Size of SET[128] array.                                              */
  #define CACHEINFO_SET_MaxIndex (127UL)             /*!< Max index of SET[128] array.                                         */
  #define CACHEINFO_SET_MinIndex (0UL)               /*!< Min index of SET[128] array.                                         */

/* ==================================================== Struct CACHEINFO ===================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {                                   /*!< CACHEINFO Structure                                                  */
    __IOM NRF_CACHEINFO_SET_Type SET[128];           /*!< (@ 0x00000000) (unspecified)                                         */
  } NRF_CACHEINFO_Type;                              /*!< Size = 1024 (0x400)                                                  */

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CCM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct CCM_KEY ====================================================== */
/**
  * @brief KEY [CCM_KEY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  VALUE[4];                          /*!< (@ 0x00000000) 128-bit AES key                                       */
} NRF_CCM_KEY_Type;                                  /*!< Size = 16 (0x010)                                                    */

/* CCM_KEY_VALUE: 128-bit AES key */
  #define CCM_KEY_VALUE_MaxCount (4UL)               /*!< Max size of VALUE[4] array.                                          */
  #define CCM_KEY_VALUE_MaxIndex (3UL)               /*!< Max index of VALUE[4] array.                                         */
  #define CCM_KEY_VALUE_MinIndex (0UL)               /*!< Min index of VALUE[4] array.                                         */
  #define CCM_KEY_VALUE_ResetValue (0x00000000UL)    /*!< Reset value of VALUE[4] register.                                    */

/* VALUE @Bits 0..31 : AES 128-bit key value, bits (32*(i+1))-1 : (32*i) */
  #define CCM_KEY_VALUE_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define CCM_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << CCM_KEY_VALUE_VALUE_Pos) /*!< Bit mask of VALUE field.                      */



/* ==================================================== Struct CCM_NONCE ===================================================== */
/**
  * @brief NONCE [CCM_NONCE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[4];                          /*!< (@ 0x00000000) 13-byte NONCE vector Only the lower 13 bytes are used */
} NRF_CCM_NONCE_Type;                                /*!< Size = 16 (0x010)                                                    */

