NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* CRYPTOMASTER @Bit 0 : Write '1' to disable interrupt for event CRYPTOMASTER */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Pos (0UL)     /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTENCLR_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.    */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Min (0x0UL)   /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Max (0x1UL)   /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Clear (0x1UL) /*!< Disable                                                              */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* RNG @Bit 1 : Write '1' to disable interrupt for event RNG */
  #define CRACEN_INTENCLR_RNG_Pos (1UL)              /*!< Position of RNG field.                                               */
  #define CRACEN_INTENCLR_RNG_Msk (0x1UL << CRACEN_INTENCLR_RNG_Pos) /*!< Bit mask of RNG field.                               */
  #define CRACEN_INTENCLR_RNG_Min (0x0UL)            /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Max (0x1UL)            /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Clear (0x1UL)          /*!< Disable                                                              */
  #define CRACEN_INTENCLR_RNG_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_RNG_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* PKEIKG @Bit 2 : Write '1' to disable interrupt for event PKEIKG */
  #define CRACEN_INTENCLR_PKEIKG_Pos (2UL)           /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTENCLR_PKEIKG_Msk (0x1UL << CRACEN_INTENCLR_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                      */
  #define CRACEN_INTENCLR_PKEIKG_Min (0x0UL)         /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENCLR_PKEIKG_Max (0x1UL)         /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENCLR_PKEIKG_Clear (0x1UL)       /*!< Disable                                                              */
  #define CRACEN_INTENCLR_PKEIKG_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_PKEIKG_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* CRACEN_INTPEND: Pending interrupts */
  #define CRACEN_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

/* CRYPTOMASTER @Bit 0 : Read pending status of interrupt for event CRYPTOMASTER */
  #define CRACEN_INTPEND_CRYPTOMASTER_Pos (0UL)      /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTPEND_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTPEND_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.      */
  #define CRACEN_INTPEND_CRYPTOMASTER_Min (0x0UL)    /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTPEND_CRYPTOMASTER_Max (0x1UL)    /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTPEND_CRYPTOMASTER_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define CRACEN_INTPEND_CRYPTOMASTER_Pending (0x1UL) /*!< Read: Pending                                                       */

/* RNG @Bit 1 : Read pending status of interrupt for event RNG */
  #define CRACEN_INTPEND_RNG_Pos (1UL)               /*!< Position of RNG field.                                               */
  #define CRACEN_INTPEND_RNG_Msk (0x1UL << CRACEN_INTPEND_RNG_Pos) /*!< Bit mask of RNG field.                                 */
  #define CRACEN_INTPEND_RNG_Min (0x0UL)             /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_Max (0x1UL)             /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_RNG_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* PKEIKG @Bit 2 : Read pending status of interrupt for event PKEIKG */
  #define CRACEN_INTPEND_PKEIKG_Pos (2UL)            /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTPEND_PKEIKG_Msk (0x1UL << CRACEN_INTPEND_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                        */
  #define CRACEN_INTPEND_PKEIKG_Min (0x0UL)          /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTPEND_PKEIKG_Max (0x1UL)          /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTPEND_PKEIKG_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_PKEIKG_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* CRACEN_ENABLE: Enable CRACEN peripheral modules. */
  #define CRACEN_ENABLE_ResetValue (0x00000000UL)    /*!< Reset value of ENABLE register.                                      */

/* CRYPTOMASTER @Bit 0 : Enable cryptomaster */
  #define CRACEN_ENABLE_CRYPTOMASTER_Pos (0UL)       /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_ENABLE_CRYPTOMASTER_Msk (0x1UL << CRACEN_ENABLE_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.        */
  #define CRACEN_ENABLE_CRYPTOMASTER_Min (0x0UL)     /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_ENABLE_CRYPTOMASTER_Max (0x1UL)     /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_ENABLE_CRYPTOMASTER_Disabled (0x0UL) /*!< Cryptomaster disabled.                                              */
  #define CRACEN_ENABLE_CRYPTOMASTER_Enabled (0x1UL) /*!< Cryptomaster enabled.                                                */

/* RNG @Bit 1 : Enable RNG */
  #define CRACEN_ENABLE_RNG_Pos (1UL)                /*!< Position of RNG field.                                               */
  #define CRACEN_ENABLE_RNG_Msk (0x1UL << CRACEN_ENABLE_RNG_Pos) /*!< Bit mask of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Min (0x0UL)              /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Max (0x1UL)              /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Disabled (0x0UL)         /*!< RNG disabled.                                                        */
  #define CRACEN_ENABLE_RNG_Enabled (0x1UL)          /*!< RNG enabled.                                                         */

/* PKEIKG @Bit 2 : Enable PKE and IKG */
  #define CRACEN_ENABLE_PKEIKG_Pos (2UL)             /*!< Position of PKEIKG field.                                            */
  #define CRACEN_ENABLE_PKEIKG_Msk (0x1UL << CRACEN_ENABLE_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                          */
  #define CRACEN_ENABLE_PKEIKG_Min (0x0UL)           /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_ENABLE_PKEIKG_Max (0x1UL)           /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_ENABLE_PKEIKG_Disabled (0x0UL)      /*!< PKE and IKG disabled.                                                */
  #define CRACEN_ENABLE_PKEIKG_Enabled (0x1UL)       /*!< PKE and IKG enabled.                                                 */


/* CRACEN_SEEDVALID: Indicates the SEED register is valid. Writing this register has no effect. */
  #define CRACEN_SEEDVALID_ResetValue (0x00000000UL) /*!< Reset value of SEEDVALID register.                                   */

/* VALID @Bit 0 : Marks the SEED as valid */
  #define CRACEN_SEEDVALID_VALID_Pos (0UL)           /*!< Position of VALID field.                                             */
  #define CRACEN_SEEDVALID_VALID_Msk (0x1UL << CRACEN_SEEDVALID_VALID_Pos) /*!< Bit mask of VALID field.                       */
  #define CRACEN_SEEDVALID_VALID_Min (0x0UL)         /*!< Min enumerator value of VALID field.                                 */
  #define CRACEN_SEEDVALID_VALID_Max (0x1UL)         /*!< Max enumerator value of VALID field.                                 */
  #define CRACEN_SEEDVALID_VALID_Disabled (0x0UL)    /*!< Valid disabled.                                                      */
  #define CRACEN_SEEDVALID_VALID_Enabled (0x1UL)     /*!< Valid enabled.                                                       */


/* CRACEN_SEED: Seed word [n] for symmetric and asymmetric key generation. This register is only writable from KMU. */
  #define CRACEN_SEED_MaxCount (12UL)                /*!< Max size of SEED[12] array.                                          */
  #define CRACEN_SEED_MaxIndex (11UL)                /*!< Max index of SEED[12] array.                                         */
  #define CRACEN_SEED_MinIndex (0UL)                 /*!< Min index of SEED[12] array.                                         */
  #define CRACEN_SEED_ResetValue (0x00000000UL)      /*!< Reset value of SEED[12] register.                                    */

/* VAL @Bits 0..31 : Seed value */
  #define CRACEN_SEED_VAL_Pos (0UL)                  /*!< Position of VAL field.                                               */
  #define CRACEN_SEED_VAL_Msk (0xFFFFFFFFUL << CRACEN_SEED_VAL_Pos) /*!< Bit mask of VAL field.                                */


/* CRACEN_SEEDLOCK: Indicates the access to the SEED register is locked. Writing this register has no effect. */
  #define CRACEN_SEEDLOCK_ResetValue (0x00000000UL)  /*!< Reset value of SEEDLOCK register.                                    */

