NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
  #define FICR_TRIMCNF_MaxCount (64UL)               /*!< Size of TRIMCNF[64] array.                                           */
  #define FICR_TRIMCNF_MaxIndex (63UL)               /*!< Max index of TRIMCNF[64] array.                                      */
  #define FICR_TRIMCNF_MinIndex (0UL)                /*!< Min index of TRIMCNF[64] array.                                      */

/* FICR_TRIMCNF_ADDR: Address of the register which will be written */
  #define FICR_TRIMCNF_ADDR_ResetValue (0xFFFFFFFFUL) /*!< Reset value of ADDR register.                                       */

/* Address @Bits 0..31 : Address */
  #define FICR_TRIMCNF_ADDR_Address_Pos (0UL)        /*!< Position of Address field.                                           */
  #define FICR_TRIMCNF_ADDR_Address_Msk (0xFFFFFFFFUL << FICR_TRIMCNF_ADDR_Address_Pos) /*!< Bit mask of Address field.        */


/* FICR_TRIMCNF_DATA: Data to be written into the register */
  #define FICR_TRIMCNF_DATA_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DATA register.                                       */

/* Data @Bits 0..31 : Data */
  #define FICR_TRIMCNF_DATA_Data_Pos (0UL)           /*!< Position of Data field.                                              */
  #define FICR_TRIMCNF_DATA_Data_Msk (0xFFFFFFFFUL << FICR_TRIMCNF_DATA_Data_Pos) /*!< Bit mask of Data field.                 */


/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {                                   /*!< FICR Structure                                                       */
    __IM uint32_t RESERVED[192];
    __IOM NRF_FICR_INFO_Type INFO;                   /*!< (@ 0x00000300) Device info                                           */
    __IM uint32_t RESERVED1[20];
    __IM uint32_t ER[4];                             /*!< (@ 0x00000380) Common encryption root key, word n                    */
    __IM uint32_t IR[4];                             /*!< (@ 0x00000390) Common identity root key, word n                      */
    __IM uint32_t DEVICEADDRTYPE;                    /*!< (@ 0x000003A0) Device address type                                   */
    __IM uint32_t DEVICEADDR[2];                     /*!< (@ 0x000003A4) Device address n                                      */
    __IM uint32_t RESERVED2[21];
    __IOM NRF_FICR_TRIMCNF_Type TRIMCNF[64];         /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED3[8];
    __IM uint32_t XOSC32MTRIM;                       /*!< (@ 0x00000620) XOSC32M capacitor selection trim values               */
    __IM uint32_t XOSC32KTRIM;                       /*!< (@ 0x00000624) XOSC32K capacitor selection trim values               */
  } NRF_FICR_Type;                                   /*!< Size = 1576 (0x628)                                                  */

/* FICR_ER: Common encryption root key, word n */
  #define FICR_ER_MaxCount (4UL)                     /*!< Max size of ER[4] array.                                             */
  #define FICR_ER_MaxIndex (3UL)                     /*!< Max index of ER[4] array.                                            */
  #define FICR_ER_MinIndex (0UL)                     /*!< Min index of ER[4] array.                                            */
  #define FICR_ER_ResetValue (0xFFFFFFFFUL)          /*!< Reset value of ER[4] register.                                       */

/* ER @Bits 0..31 : Encryption Root, word n */
  #define FICR_ER_ER_Pos (0UL)                       /*!< Position of ER field.                                                */
  #define FICR_ER_ER_Msk (0xFFFFFFFFUL << FICR_ER_ER_Pos) /*!< Bit mask of ER field.                                           */


/* FICR_IR: Common identity root key, word n */
  #define FICR_IR_MaxCount (4UL)                     /*!< Max size of IR[4] array.                                             */
  #define FICR_IR_MaxIndex (3UL)                     /*!< Max index of IR[4] array.                                            */
  #define FICR_IR_MinIndex (0UL)                     /*!< Min index of IR[4] array.                                            */
  #define FICR_IR_ResetValue (0xFFFFFFFFUL)          /*!< Reset value of IR[4] register.                                       */

/* IR @Bits 0..31 : Identity Root, word n */
  #define FICR_IR_IR_Pos (0UL)                       /*!< Position of IR field.                                                */
  #define FICR_IR_IR_Msk (0xFFFFFFFFUL << FICR_IR_IR_Pos) /*!< Bit mask of IR field.                                           */


/* FICR_DEVICEADDRTYPE: Device address type */
  #define FICR_DEVICEADDRTYPE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DEVICEADDRTYPE register.                           */

/* DEVICEADDRTYPE @Bit 0 : Device address type */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos (0UL) /*!< Position of DEVICEADDRTYPE field.                                  */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Msk (0x1UL << FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos) /*!< Bit mask of
                                                                            DEVICEADDRTYPE field.*/
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Min (0x0UL) /*!< Min enumerator value of DEVICEADDRTYPE field.                    */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Max (0x1UL) /*!< Max enumerator value of DEVICEADDRTYPE field.                    */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Public (0x0UL) /*!< Public address                                                */
  #define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Random (0x1UL) /*!< Random address                                                */


/* FICR_DEVICEADDR: Device address n */
  #define FICR_DEVICEADDR_MaxCount (2UL)             /*!< Max size of DEVICEADDR[2] array.                                     */
  #define FICR_DEVICEADDR_MaxIndex (1UL)             /*!< Max index of DEVICEADDR[2] array.                                    */
  #define FICR_DEVICEADDR_MinIndex (0UL)             /*!< Min index of DEVICEADDR[2] array.                                    */
  #define FICR_DEVICEADDR_ResetValue (0xFFFFFFFFUL)  /*!< Reset value of DEVICEADDR[2] register.                               */

