NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* PWMPERIODEND @Bit 27 : Enable or disable interrupt for event PWMPERIODEND */
  #define GRTC_INTEN2_PWMPERIODEND_Pos (27UL)        /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTEN2_PWMPERIODEND_Msk (0x1UL << GRTC_INTEN2_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.            */
  #define GRTC_INTEN2_PWMPERIODEND_Min (0x0UL)       /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTEN2_PWMPERIODEND_Max (0x1UL)       /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTEN2_PWMPERIODEND_Disabled (0x0UL)  /*!< Disable                                                              */
  #define GRTC_INTEN2_PWMPERIODEND_Enabled (0x1UL)   /*!< Enable                                                               */

/* PWMREADY @Bit 29 : Enable or disable interrupt for event PWMREADY */
  #define GRTC_INTEN2_PWMREADY_Pos (29UL)            /*!< Position of PWMREADY field.                                          */
  #define GRTC_INTEN2_PWMREADY_Msk (0x1UL << GRTC_INTEN2_PWMREADY_Pos) /*!< Bit mask of PWMREADY field.                        */
  #define GRTC_INTEN2_PWMREADY_Min (0x0UL)           /*!< Min enumerator value of PWMREADY field.                              */
  #define GRTC_INTEN2_PWMREADY_Max (0x1UL)           /*!< Max enumerator value of PWMREADY field.                              */
  #define GRTC_INTEN2_PWMREADY_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN2_PWMREADY_Enabled (0x1UL)       /*!< Enable                                                               */

/* CLKOUTREADY @Bit 30 : Enable or disable interrupt for event CLKOUTREADY */
  #define GRTC_INTEN2_CLKOUTREADY_Pos (30UL)         /*!< Position of CLKOUTREADY field.                                       */
  #define GRTC_INTEN2_CLKOUTREADY_Msk (0x1UL << GRTC_INTEN2_CLKOUTREADY_Pos) /*!< Bit mask of CLKOUTREADY field.               */
  #define GRTC_INTEN2_CLKOUTREADY_Min (0x0UL)        /*!< Min enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTEN2_CLKOUTREADY_Max (0x1UL)        /*!< Max enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTEN2_CLKOUTREADY_Disabled (0x0UL)   /*!< Disable                                                              */
  #define GRTC_INTEN2_CLKOUTREADY_Enabled (0x1UL)    /*!< Enable                                                               */


/* GRTC_INTENSET2: Enable interrupt */
  #define GRTC_INTENSET2_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET2 register.                                   */

/* COMPARE0 @Bit 0 : Write '1' to enable interrupt for event COMPARE[0] */
  #define GRTC_INTENSET2_COMPARE0_Pos (0UL)          /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTENSET2_COMPARE0_Msk (0x1UL << GRTC_INTENSET2_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define GRTC_INTENSET2_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENSET2_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTENSET2_COMPARE0_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET2_COMPARE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET2_COMPARE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 1 : Write '1' to enable interrupt for event COMPARE[1] */
  #define GRTC_INTENSET2_COMPARE1_Pos (1UL)          /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTENSET2_COMPARE1_Msk (0x1UL << GRTC_INTENSET2_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                  */
  #define GRTC_INTENSET2_COMPARE1_Min (0x0UL)        /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENSET2_COMPARE1_Max (0x1UL)        /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTENSET2_COMPARE1_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET2_COMPARE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET2_COMPARE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE2 @Bit 2 : Write '1' to enable interrupt for event COMPARE[2] */
  #define GRTC_INTENSET2_COMPARE2_Pos (2UL)          /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTENSET2_COMPARE2_Msk (0x1UL << GRTC_INTENSET2_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                  */
  #define GRTC_INTENSET2_COMPARE2_Min (0x0UL)        /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTENSET2_COMPARE2_Max (0x1UL)        /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTENSET2_COMPARE2_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET2_COMPARE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET2_COMPARE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE3 @Bit 3 : Write '1' to enable interrupt for event COMPARE[3] */
  #define GRTC_INTENSET2_COMPARE3_Pos (3UL)          /*!< Position of COMPARE3 field.                                          */
  #define GRTC_INTENSET2_COMPARE3_Msk (0x1UL << GRTC_INTENSET2_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                  */
  #define GRTC_INTENSET2_COMPARE3_Min (0x0UL)        /*!< Min enumerator value of COMPARE3 field.                              */
  #define GRTC_INTENSET2_COMPARE3_Max (0x1UL)        /*!< Max enumerator value of COMPARE3 field.                              */
  #define GRTC_INTENSET2_COMPARE3_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET2_COMPARE3_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET2_COMPARE3_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE4 @Bit 4 : Write '1' to enable interrupt for event COMPARE[4] */
  #define GRTC_INTENSET2_COMPARE4_Pos (4UL)          /*!< Position of COMPARE4 field.                                          */
  #define GRTC_INTENSET2_COMPARE4_Msk (0x1UL << GRTC_INTENSET2_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                  */
  #define GRTC_INTENSET2_COMPARE4_Min (0x0UL)        /*!< Min enumerator value of COMPARE4 field.                              */
  #define GRTC_INTENSET2_COMPARE4_Max (0x1UL)        /*!< Max enumerator value of COMPARE4 field.                              */
  #define GRTC_INTENSET2_COMPARE4_Set (0x1UL)        /*!< Enable                                                               */
  #define GRTC_INTENSET2_COMPARE4_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENSET2_COMPARE4_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

