NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* SYSCOUNTEREN @Bit 1 : Enable the SYSCOUNTER */
  #define GRTC_MODE_SYSCOUNTEREN_Pos (1UL)           /*!< Position of SYSCOUNTEREN field.                                      */
  #define GRTC_MODE_SYSCOUNTEREN_Msk (0x1UL << GRTC_MODE_SYSCOUNTEREN_Pos) /*!< Bit mask of SYSCOUNTEREN field.                */
  #define GRTC_MODE_SYSCOUNTEREN_Min (0x0UL)         /*!< Min enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Max (0x1UL)         /*!< Max enumerator value of SYSCOUNTEREN field.                          */
  #define GRTC_MODE_SYSCOUNTEREN_Disabled (0x0UL)    /*!< SYSCOUNTER disabled                                                  */
  #define GRTC_MODE_SYSCOUNTEREN_Enabled (0x1UL)     /*!< SYSCOUNTER enabled                                                   */


/* GRTC_TIMEOUT: Timeout after all CPUs gone into sleep state to stop the SYSCOUNTER */
  #define GRTC_TIMEOUT_ResetValue (0x00000000UL)     /*!< Reset value of TIMEOUT register.                                     */

/* VALUE @Bits 0..15 : Number of 32Ki cycles */
  #define GRTC_TIMEOUT_VALUE_Pos (0UL)               /*!< Position of VALUE field.                                             */
  #define GRTC_TIMEOUT_VALUE_Msk (0xFFFFUL << GRTC_TIMEOUT_VALUE_Pos) /*!< Bit mask of VALUE field.                            */


/* GRTC_INTERVAL: Count to add to CC[0] when the event EVENTS_COMPARE[0] triggers. */
  #define GRTC_INTERVAL_ResetValue (0x00000000UL)    /*!< Reset value of INTERVAL register.                                    */

/* VALUE @Bits 0..15 : Count to add to CC[0] */
  #define GRTC_INTERVAL_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_INTERVAL_VALUE_Msk (0xFFFFUL << GRTC_INTERVAL_VALUE_Pos) /*!< Bit mask of VALUE field.                          */


/* GRTC_WAKETIME: GRTC wake up time. */
  #define GRTC_WAKETIME_ResetValue (0x00000001UL)    /*!< Reset value of WAKETIME register.                                    */

/* VALUE @Bits 0..7 : Number of LFCLK clock cycles to wake up before the next scheduled EVENTS_COMPARE event */
  #define GRTC_WAKETIME_VALUE_Pos (0UL)              /*!< Position of VALUE field.                                             */
  #define GRTC_WAKETIME_VALUE_Msk (0xFFUL << GRTC_WAKETIME_VALUE_Pos) /*!< Bit mask of VALUE field.                            */


/* GRTC_PWMCONFIG: PWM configuration. */
  #define GRTC_PWMCONFIG_ResetValue (0x00000000UL)   /*!< Reset value of PWMCONFIG register.                                   */

/* COMPAREVALUE @Bits 0..7 : The PWM compare value */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Pos (0UL)      /*!< Position of COMPAREVALUE field.                                      */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Msk (0xFFUL << GRTC_PWMCONFIG_COMPAREVALUE_Pos) /*!< Bit mask of COMPAREVALUE field.     */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Min (0x01UL)   /*!< Min value of COMPAREVALUE field.                                     */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Max (0xFFUL)   /*!< Max size of COMPAREVALUE field.                                      */


/* GRTC_CLKOUT: Configuration of clock output */
  #define GRTC_CLKOUT_ResetValue (0x00000000UL)      /*!< Reset value of CLKOUT register.                                      */

/* CLKOUT32K @Bit 0 : Enable 32Ki clock output on pin */
  #define GRTC_CLKOUT_CLKOUT32K_Pos (0UL)            /*!< Position of CLKOUT32K field.                                         */
  #define GRTC_CLKOUT_CLKOUT32K_Msk (0x1UL << GRTC_CLKOUT_CLKOUT32K_Pos) /*!< Bit mask of CLKOUT32K field.                     */
  #define GRTC_CLKOUT_CLKOUT32K_Min (0x0UL)          /*!< Min enumerator value of CLKOUT32K field.                             */
  #define GRTC_CLKOUT_CLKOUT32K_Max (0x1UL)          /*!< Max enumerator value of CLKOUT32K field.                             */
  #define GRTC_CLKOUT_CLKOUT32K_Disabled (0x0UL)     /*!< Disabled                                                             */
  #define GRTC_CLKOUT_CLKOUT32K_Enabled (0x1UL)      /*!< Enabled                                                              */

/* CLKOUTFAST @Bit 1 : Enable fast clock output on pin */
  #define GRTC_CLKOUT_CLKOUTFAST_Pos (1UL)           /*!< Position of CLKOUTFAST field.                                        */
  #define GRTC_CLKOUT_CLKOUTFAST_Msk (0x1UL << GRTC_CLKOUT_CLKOUTFAST_Pos) /*!< Bit mask of CLKOUTFAST field.                  */
  #define GRTC_CLKOUT_CLKOUTFAST_Min (0x0UL)         /*!< Min enumerator value of CLKOUTFAST field.                            */
  #define GRTC_CLKOUT_CLKOUTFAST_Max (0x1UL)         /*!< Max enumerator value of CLKOUTFAST field.                            */
  #define GRTC_CLKOUT_CLKOUTFAST_Disabled (0x0UL)    /*!< Disabled                                                             */
  #define GRTC_CLKOUT_CLKOUTFAST_Enabled (0x1UL)     /*!< Enabled                                                              */


/* GRTC_CLKCFG: Clock Configuration */
  #define GRTC_CLKCFG_ResetValue (0x00010001UL)      /*!< Reset value of CLKCFG register.                                      */

/* CLKFASTDIV @Bits 0..7 : Fast clock divisor value of clock output */
  #define GRTC_CLKCFG_CLKFASTDIV_Pos (0UL)           /*!< Position of CLKFASTDIV field.                                        */
  #define GRTC_CLKCFG_CLKFASTDIV_Msk (0xFFUL << GRTC_CLKCFG_CLKFASTDIV_Pos) /*!< Bit mask of CLKFASTDIV field.                 */
  #define GRTC_CLKCFG_CLKFASTDIV_Min (0x01UL)        /*!< Min value of CLKFASTDIV field.                                       */
  #define GRTC_CLKCFG_CLKFASTDIV_Max (0xFFUL)        /*!< Max size of CLKFASTDIV field.                                        */

/* CLKSEL @Bits 16..17 : GRTC LFCLK clock source selection */
  #define GRTC_CLKCFG_CLKSEL_Pos (16UL)              /*!< Position of CLKSEL field.                                            */
  #define GRTC_CLKCFG_CLKSEL_Msk (0x3UL << GRTC_CLKCFG_CLKSEL_Pos) /*!< Bit mask of CLKSEL field.                              */
  #define GRTC_CLKCFG_CLKSEL_Min (0x0UL)             /*!< Min enumerator value of CLKSEL field.                                */
  #define GRTC_CLKCFG_CLKSEL_Max (0x2UL)             /*!< Max enumerator value of CLKSEL field.                                */
  #define GRTC_CLKCFG_CLKSEL_LFXO (0x0UL)            /*!< GRTC LFCLK clock source is LFXO                                      */
  #define GRTC_CLKCFG_CLKSEL_SystemLFCLK (0x1UL)     /*!< GRTC LFCLK clock source is system LFCLK                              */
  #define GRTC_CLKCFG_CLKSEL_LFLPRC (0x2UL)          /*!< GRTC LFCLK clock source is LFLPRC                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            KMU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct KMU ======================================================== */
/**
  * @brief Key management unit
  */
  typedef struct {                                   /*!< KMU Structure                                                        */
    __OM uint32_t TASKS_PROVISION;                   /*!< (@ 0x00000000) Provision key slot                                    */
    __OM uint32_t TASKS_PUSH;                        /*!< (@ 0x00000004) Push key slot                                         */
    __OM uint32_t TASKS_REVOKE;                      /*!< (@ 0x00000008) Revoke key slot                                       */
    __OM uint32_t TASKS_READMETADATA;                /*!< (@ 0x0000000C) Read key slot metadata into METADATA register         */
    __OM uint32_t TASKS_PUSHBLOCK;                   /*!< (@ 0x00000010) Block only the PUSH operation of a key slot, preventing
                                                                         the key slot from being PUSHED until next reset. The
                                                                         task is kept for backwards compatibility.*/
    __OM uint32_t TASKS_BLOCK;                       /*!< (@ 0x00000014) Block the PROVISION, PUSH, and REVOKE operations of a
                                                                         key slot, preventing the key slot from being
                                                                         PROVISIONED, PUSHED, or REVOKED until next reset*/
    __IM uint32_t RESERVED[58];
    __IOM uint32_t EVENTS_PROVISIONED;               /*!< (@ 0x00000100) Key slot successfully provisioned                     */
    __IOM uint32_t EVENTS_PUSHED;                    /*!< (@ 0x00000104) Key slot successfully pushed                          */
    __IOM uint32_t EVENTS_REVOKED;                   /*!< (@ 0x00000108) Key slot has been revoked and can no longer be used   */
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x0000010C) Error generated during PROVISION, PUSH, READMETADATA or
                                                                         REVOKE operations. Triggering the PROVISION, PUSH and
                                                                         REVOKE tasks on a BLOCKED keyslot will also generate
                                                                         this event.*/
    __IOM uint32_t EVENTS_METADATAREAD;              /*!< (@ 0x00000110) Key slot metadata has been read into METADATA register*/
    __IOM uint32_t EVENTS_PUSHBLOCKED;               /*!< (@ 0x00000114) The PUSHBLOCK operation was successful. The event is
                                                                         kept for backwards compatibility.*/
    __IOM uint32_t EVENTS_BLOCKED;                   /*!< (@ 0x00000118) The BLOCK operation was successful                    */
    __IM uint32_t RESERVED1[185];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) KMU status register                                   */
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t KEYSLOT;                          /*!< (@ 0x00000500) Select key slot to operate on                         */
    __IOM uint32_t SRC;                              /*!< (@ 0x00000504) Source address for provisioning                       */
    __IOM uint32_t METADATA;                         /*!< (@ 0x00000508) Key slot metadata as read by TASKS_READMETADATA.      */
  } NRF_KMU_Type;                                    /*!< Size = 1292 (0x50C)                                                  */

/* KMU_TASKS_PROVISION: Provision key slot */
  #define KMU_TASKS_PROVISION_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PROVISION register.                          */

/* TASKS_PROVISION @Bit 0 : Provision key slot */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Pos (0UL) /*!< Position of TASKS_PROVISION field.                                */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Msk (0x1UL << KMU_TASKS_PROVISION_TASKS_PROVISION_Pos) /*!< Bit mask of
                                                                            TASKS_PROVISION field.*/
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Min (0x1UL) /*!< Min enumerator value of TASKS_PROVISION field.                  */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Max (0x1UL) /*!< Max enumerator value of TASKS_PROVISION field.                  */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Trigger (0x1UL) /*!< Trigger task                                                */


/* KMU_TASKS_PUSH: Push key slot */
  #define KMU_TASKS_PUSH_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_PUSH register.                                  */

/* TASKS_PUSH @Bit 0 : Push key slot */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Pos (0UL)        /*!< Position of TASKS_PUSH field.                                        */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Msk (0x1UL << KMU_TASKS_PUSH_TASKS_PUSH_Pos) /*!< Bit mask of TASKS_PUSH field.            */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Min (0x1UL)      /*!< Min enumerator value of TASKS_PUSH field.                            */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Max (0x1UL)      /*!< Max enumerator value of TASKS_PUSH field.                            */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* KMU_TASKS_REVOKE: Revoke key slot */
  #define KMU_TASKS_REVOKE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_REVOKE register.                                */

/* TASKS_REVOKE @Bit 0 : Revoke key slot */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Pos (0UL)    /*!< Position of TASKS_REVOKE field.                                      */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Msk (0x1UL << KMU_TASKS_REVOKE_TASKS_REVOKE_Pos) /*!< Bit mask of TASKS_REVOKE field.  */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Min (0x1UL)  /*!< Min enumerator value of TASKS_REVOKE field.                          */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Max (0x1UL)  /*!< Max enumerator value of TASKS_REVOKE field.                          */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Trigger (0x1UL) /*!< Trigger task                                                      */


/* KMU_TASKS_READMETADATA: Read key slot metadata into METADATA register */
  #define KMU_TASKS_READMETADATA_ResetValue (0x00000000UL) /*!< Reset value of TASKS_READMETADATA register.                    */

/* TASKS_READMETADATA @Bit 0 : Read key slot metadata into METADATA register */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Pos (0UL) /*!< Position of TASKS_READMETADATA field.                       */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Msk (0x1UL << KMU_TASKS_READMETADATA_TASKS_READMETADATA_Pos) /*!< Bit mask
                                                                            of TASKS_READMETADATA field.*/
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Min (0x1UL) /*!< Min enumerator value of TASKS_READMETADATA field.         */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Max (0x1UL) /*!< Max enumerator value of TASKS_READMETADATA field.         */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Trigger (0x1UL) /*!< Trigger task                                          */


/* KMU_TASKS_PUSHBLOCK: Block only the PUSH operation of a key slot, preventing the key slot from being PUSHED until next reset.
                         The task is kept for backwards compatibility. */

  #define KMU_TASKS_PUSHBLOCK_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PUSHBLOCK register.                          */

