NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* UP @Bit 2 : Write '1' to disable interrupt for event UP */
  #define LPCOMP_INTENCLR_UP_Pos (2UL)               /*!< Position of UP field.                                                */
  #define LPCOMP_INTENCLR_UP_Msk (0x1UL << LPCOMP_INTENCLR_UP_Pos) /*!< Bit mask of UP field.                                  */
  #define LPCOMP_INTENCLR_UP_Min (0x0UL)             /*!< Min enumerator value of UP field.                                    */
  #define LPCOMP_INTENCLR_UP_Max (0x1UL)             /*!< Max enumerator value of UP field.                                    */
  #define LPCOMP_INTENCLR_UP_Clear (0x1UL)           /*!< Disable                                                              */
  #define LPCOMP_INTENCLR_UP_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENCLR_UP_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* CROSS @Bit 3 : Write '1' to disable interrupt for event CROSS */
  #define LPCOMP_INTENCLR_CROSS_Pos (3UL)            /*!< Position of CROSS field.                                             */
  #define LPCOMP_INTENCLR_CROSS_Msk (0x1UL << LPCOMP_INTENCLR_CROSS_Pos) /*!< Bit mask of CROSS field.                         */
  #define LPCOMP_INTENCLR_CROSS_Min (0x0UL)          /*!< Min enumerator value of CROSS field.                                 */
  #define LPCOMP_INTENCLR_CROSS_Max (0x1UL)          /*!< Max enumerator value of CROSS field.                                 */
  #define LPCOMP_INTENCLR_CROSS_Clear (0x1UL)        /*!< Disable                                                              */
  #define LPCOMP_INTENCLR_CROSS_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define LPCOMP_INTENCLR_CROSS_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* LPCOMP_INTPEND: Pending interrupts */
  #define LPCOMP_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define LPCOMP_INTPEND_READY_Pos (0UL)             /*!< Position of READY field.                                             */
  #define LPCOMP_INTPEND_READY_Msk (0x1UL << LPCOMP_INTPEND_READY_Pos) /*!< Bit mask of READY field.                           */
  #define LPCOMP_INTPEND_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define LPCOMP_INTPEND_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define LPCOMP_INTPEND_READY_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define LPCOMP_INTPEND_READY_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* DOWN @Bit 1 : Read pending status of interrupt for event DOWN */
  #define LPCOMP_INTPEND_DOWN_Pos (1UL)              /*!< Position of DOWN field.                                              */
  #define LPCOMP_INTPEND_DOWN_Msk (0x1UL << LPCOMP_INTPEND_DOWN_Pos) /*!< Bit mask of DOWN field.                              */
  #define LPCOMP_INTPEND_DOWN_Min (0x0UL)            /*!< Min enumerator value of DOWN field.                                  */
  #define LPCOMP_INTPEND_DOWN_Max (0x1UL)            /*!< Max enumerator value of DOWN field.                                  */
  #define LPCOMP_INTPEND_DOWN_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define LPCOMP_INTPEND_DOWN_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* UP @Bit 2 : Read pending status of interrupt for event UP */
  #define LPCOMP_INTPEND_UP_Pos (2UL)                /*!< Position of UP field.                                                */
  #define LPCOMP_INTPEND_UP_Msk (0x1UL << LPCOMP_INTPEND_UP_Pos) /*!< Bit mask of UP field.                                    */
  #define LPCOMP_INTPEND_UP_Min (0x0UL)              /*!< Min enumerator value of UP field.                                    */
  #define LPCOMP_INTPEND_UP_Max (0x1UL)              /*!< Max enumerator value of UP field.                                    */
  #define LPCOMP_INTPEND_UP_NotPending (0x0UL)       /*!< Read: Not pending                                                    */
  #define LPCOMP_INTPEND_UP_Pending (0x1UL)          /*!< Read: Pending                                                        */

/* CROSS @Bit 3 : Read pending status of interrupt for event CROSS */
  #define LPCOMP_INTPEND_CROSS_Pos (3UL)             /*!< Position of CROSS field.                                             */
  #define LPCOMP_INTPEND_CROSS_Msk (0x1UL << LPCOMP_INTPEND_CROSS_Pos) /*!< Bit mask of CROSS field.                           */
  #define LPCOMP_INTPEND_CROSS_Min (0x0UL)           /*!< Min enumerator value of CROSS field.                                 */
  #define LPCOMP_INTPEND_CROSS_Max (0x1UL)           /*!< Max enumerator value of CROSS field.                                 */
  #define LPCOMP_INTPEND_CROSS_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define LPCOMP_INTPEND_CROSS_Pending (0x1UL)       /*!< Read: Pending                                                        */


/* LPCOMP_RESULT: Compare result */
  #define LPCOMP_RESULT_ResetValue (0x00000000UL)    /*!< Reset value of RESULT register.                                      */

/* RESULT @Bit 0 : Result of last compare. Decision point SAMPLE task. */
  #define LPCOMP_RESULT_RESULT_Pos (0UL)             /*!< Position of RESULT field.                                            */
  #define LPCOMP_RESULT_RESULT_Msk (0x1UL << LPCOMP_RESULT_RESULT_Pos) /*!< Bit mask of RESULT field.                          */
  #define LPCOMP_RESULT_RESULT_Min (0x0UL)           /*!< Min enumerator value of RESULT field.                                */
  #define LPCOMP_RESULT_RESULT_Max (0x1UL)           /*!< Max enumerator value of RESULT field.                                */
  #define LPCOMP_RESULT_RESULT_Below (0x0UL)         /*!< Input voltage is below the reference threshold (VIN+ < VIN-)         */
  #define LPCOMP_RESULT_RESULT_Above (0x1UL)         /*!< Input voltage is above the reference threshold (VIN+ > VIN-)         */


/* LPCOMP_ENABLE: Enable LPCOMP */
  #define LPCOMP_ENABLE_ResetValue (0x00000000UL)    /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..1 : Enable or disable LPCOMP */
  #define LPCOMP_ENABLE_ENABLE_Pos (0UL)             /*!< Position of ENABLE field.                                            */
  #define LPCOMP_ENABLE_ENABLE_Msk (0x3UL << LPCOMP_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                          */
  #define LPCOMP_ENABLE_ENABLE_Min (0x0UL)           /*!< Min enumerator value of ENABLE field.                                */
  #define LPCOMP_ENABLE_ENABLE_Max (0x1UL)           /*!< Max enumerator value of ENABLE field.                                */
  #define LPCOMP_ENABLE_ENABLE_Disabled (0x0UL)      /*!< Disable                                                              */
  #define LPCOMP_ENABLE_ENABLE_Enabled (0x1UL)       /*!< Enable                                                               */


/* LPCOMP_PSEL: Input pin select */
  #define LPCOMP_PSEL_ResetValue (0x00000000UL)      /*!< Reset value of PSEL register.                                        */

/* PIN @Bits 0..4 : Analog pin select */
  #define LPCOMP_PSEL_PIN_Pos (0UL)                  /*!< Position of PIN field.                                               */
  #define LPCOMP_PSEL_PIN_Msk (0x1FUL << LPCOMP_PSEL_PIN_Pos) /*!< Bit mask of PIN field.                                      */

