NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* PORT @Bits 8..11 : GPIO Port selection */
  #define LPCOMP_PSEL_PORT_Pos (8UL)                 /*!< Position of PORT field.                                              */
  #define LPCOMP_PSEL_PORT_Msk (0xFUL << LPCOMP_PSEL_PORT_Pos) /*!< Bit mask of PORT field.                                    */


/* LPCOMP_REFSEL: Reference select */
  #define LPCOMP_REFSEL_ResetValue (0x00000004UL)    /*!< Reset value of REFSEL register.                                      */

/* REFSEL @Bits 0..3 : Reference select */
  #define LPCOMP_REFSEL_REFSEL_Pos (0UL)             /*!< Position of REFSEL field.                                            */
  #define LPCOMP_REFSEL_REFSEL_Msk (0xFUL << LPCOMP_REFSEL_REFSEL_Pos) /*!< Bit mask of REFSEL field.                          */
  #define LPCOMP_REFSEL_REFSEL_Min (0x0UL)           /*!< Min enumerator value of REFSEL field.                                */
  #define LPCOMP_REFSEL_REFSEL_Max (0xFUL)           /*!< Max enumerator value of REFSEL field.                                */
  #define LPCOMP_REFSEL_REFSEL_Ref1_8Vdd (0x0UL)     /*!< VDD * 1/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref2_8Vdd (0x1UL)     /*!< VDD * 2/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref3_8Vdd (0x2UL)     /*!< VDD * 3/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref4_8Vdd (0x3UL)     /*!< VDD * 4/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref5_8Vdd (0x4UL)     /*!< VDD * 5/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref6_8Vdd (0x5UL)     /*!< VDD * 6/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_Ref7_8Vdd (0x6UL)     /*!< VDD * 7/8 selected as reference                                      */
  #define LPCOMP_REFSEL_REFSEL_ARef (0x7UL)          /*!< External analog reference selected                                   */
  #define LPCOMP_REFSEL_REFSEL_Ref1_16Vdd (0x8UL)    /*!< VDD * 1/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref3_16Vdd (0x9UL)    /*!< VDD * 3/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref5_16Vdd (0xAUL)    /*!< VDD * 5/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref7_16Vdd (0xBUL)    /*!< VDD * 7/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref9_16Vdd (0xCUL)    /*!< VDD * 9/16 selected as reference                                     */
  #define LPCOMP_REFSEL_REFSEL_Ref11_16Vdd (0xDUL)   /*!< VDD * 11/16 selected as reference                                    */
  #define LPCOMP_REFSEL_REFSEL_Ref13_16Vdd (0xEUL)   /*!< VDD * 13/16 selected as reference                                    */
  #define LPCOMP_REFSEL_REFSEL_Ref15_16Vdd (0xFUL)   /*!< VDD * 15/16 selected as reference                                    */


/* LPCOMP_EXTREFSEL: External reference select */
  #define LPCOMP_EXTREFSEL_ResetValue (0x00000000UL) /*!< Reset value of EXTREFSEL register.                                   */

/* PIN @Bits 0..4 : External analog reference pin select */
  #define LPCOMP_EXTREFSEL_PIN_Pos (0UL)             /*!< Position of PIN field.                                               */
  #define LPCOMP_EXTREFSEL_PIN_Msk (0x1FUL << LPCOMP_EXTREFSEL_PIN_Pos) /*!< Bit mask of PIN field.                            */

/* PORT @Bits 8..11 : GPIO Port selection */
  #define LPCOMP_EXTREFSEL_PORT_Pos (8UL)            /*!< Position of PORT field.                                              */
  #define LPCOMP_EXTREFSEL_PORT_Msk (0xFUL << LPCOMP_EXTREFSEL_PORT_Pos) /*!< Bit mask of PORT field.                          */


/* LPCOMP_ANADETECT: Analog detect configuration */
  #define LPCOMP_ANADETECT_ResetValue (0x00000000UL) /*!< Reset value of ANADETECT register.                                   */

/* ANADETECT @Bits 0..1 : Analog detect configuration */
  #define LPCOMP_ANADETECT_ANADETECT_Pos (0UL)       /*!< Position of ANADETECT field.                                         */
  #define LPCOMP_ANADETECT_ANADETECT_Msk (0x3UL << LPCOMP_ANADETECT_ANADETECT_Pos) /*!< Bit mask of ANADETECT field.           */
  #define LPCOMP_ANADETECT_ANADETECT_Min (0x0UL)     /*!< Min enumerator value of ANADETECT field.                             */
  #define LPCOMP_ANADETECT_ANADETECT_Max (0x2UL)     /*!< Max enumerator value of ANADETECT field.                             */
  #define LPCOMP_ANADETECT_ANADETECT_Cross (0x0UL)   /*!< Generate ANADETECT on crossing, both upward crossing and downward
                                                          crossing*/
  #define LPCOMP_ANADETECT_ANADETECT_Up (0x1UL)      /*!< Generate ANADETECT on upward crossing only                           */
  #define LPCOMP_ANADETECT_ANADETECT_Down (0x2UL)    /*!< Generate ANADETECT on downward crossing only                         */


/* LPCOMP_HYST: Comparator hysteresis enable */
  #define LPCOMP_HYST_ResetValue (0x00000000UL)      /*!< Reset value of HYST register.                                        */

/* HYST @Bit 0 : Comparator hysteresis enable */
  #define LPCOMP_HYST_HYST_Pos (0UL)                 /*!< Position of HYST field.                                              */
  #define LPCOMP_HYST_HYST_Msk (0x1UL << LPCOMP_HYST_HYST_Pos) /*!< Bit mask of HYST field.                                    */
  #define LPCOMP_HYST_HYST_Min (0x0UL)               /*!< Min enumerator value of HYST field.                                  */
  #define LPCOMP_HYST_HYST_Max (0x1UL)               /*!< Max enumerator value of HYST field.                                  */
  #define LPCOMP_HYST_HYST_Disabled (0x0UL)          /*!< Comparator hysteresis disabled                                       */
  #define LPCOMP_HYST_HYST_Enabled (0x1UL)           /*!< Comparator hysteresis enabled                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          MEMCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

