NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* VAL @Bits 0..5 : Crystal load capacitor value */
  #define OSCILLATORS_XOSC32M_CONFIG_INTCAP_VAL_Pos (0UL) /*!< Position of VAL field.                                          */
  #define OSCILLATORS_XOSC32M_CONFIG_INTCAP_VAL_Msk (0x3FUL << OSCILLATORS_XOSC32M_CONFIG_INTCAP_VAL_Pos) /*!< Bit mask of VAL
                                                                            field.*/



/* =============================================== Struct OSCILLATORS_XOSC32M ================================================ */
/**
  * @brief XOSC32M [OSCILLATORS_XOSC32M] 32 MHz oscillator control
  */
typedef struct {
  __IM  uint32_t  RESERVED[5];
  __IOM NRF_OSCILLATORS_XOSC32M_CONFIG_Type CONFIG;  /*!< (@ 0x00000014) (unspecified)                                         */
} NRF_OSCILLATORS_XOSC32M_Type;                      /*!< Size = 32 (0x020)                                                    */


/* ================================================= Struct OSCILLATORS_PLL ================================================== */
/**
  * @brief PLL [OSCILLATORS_PLL] Oscillator control
  */
typedef struct {
  __IOM uint32_t  FREQ;                              /*!< (@ 0x00000000) Set speed of MCU power domain, including CPU          */
  __IM  uint32_t  CURRENTFREQ;                       /*!< (@ 0x00000004) Current speed of MCU power domain, including CPU      */
} NRF_OSCILLATORS_PLL_Type;                          /*!< Size = 8 (0x008)                                                     */

/* OSCILLATORS_PLL_FREQ: Set speed of MCU power domain, including CPU */
  #define OSCILLATORS_PLL_FREQ_ResetValue (0x00000003UL) /*!< Reset value of FREQ register.                                    */

/* FREQ @Bits 0..1 : Select CPU speed */
  #define OSCILLATORS_PLL_FREQ_FREQ_Pos (0UL)        /*!< Position of FREQ field.                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_Msk (0x3UL << OSCILLATORS_PLL_FREQ_FREQ_Pos) /*!< Bit mask of FREQ field.                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_Min (0x1UL)      /*!< Min enumerator value of FREQ field.                                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_Max (0x3UL)      /*!< Max enumerator value of FREQ field.                                  */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK128M (0x1UL)   /*!< 128 MHz                                                              */
  #define OSCILLATORS_PLL_FREQ_FREQ_CK64M (0x3UL)    /*!< 64 MHz                                                               */


/* OSCILLATORS_PLL_CURRENTFREQ: Current speed of MCU power domain, including CPU */
  #define OSCILLATORS_PLL_CURRENTFREQ_ResetValue (0x00000003UL) /*!< Reset value of CURRENTFREQ register.                      */

/* CURRENTFREQ @Bits 0..1 : Active CPU speed */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Pos (0UL) /*!< Position of CURRENTFREQ field.                                */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Msk (0x3UL << OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Pos) /*!< Bit mask of
                                                                            CURRENTFREQ field.*/
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Min (0x1UL) /*!< Min enumerator value of CURRENTFREQ field.                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_Max (0x3UL) /*!< Max enumerator value of CURRENTFREQ field.                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK128M (0x1UL) /*!< 128 MHz                                                  */
  #define OSCILLATORS_PLL_CURRENTFREQ_CURRENTFREQ_CK64M (0x3UL) /*!< 64 MHz                                                    */



/* =============================================== Struct OSCILLATORS_XOSC32KI =============================================== */
/**
  * @brief XOSC32KI [OSCILLATORS_XOSC32KI] 32.768 kHz oscillator control
  */
typedef struct {
  __IOM uint32_t  BYPASS;                            /*!< (@ 0x00000000) Enable or disable bypass of LFCLK crystal oscillator
                                                                         with external clock source*/
  __IOM uint32_t  INTCAP;                            /*!< (@ 0x00000004) Programmable capacitance of XL1 and XL2               */
  __IM  uint32_t  RESERVED[3];
  __IM  uint32_t  STATUS;                            /*!< (@ 0x00000014) Status information                                    */
} NRF_OSCILLATORS_XOSC32KI_Type;                     /*!< Size = 24 (0x018)                                                    */

/* OSCILLATORS_XOSC32KI_BYPASS: Enable or disable bypass of LFCLK crystal oscillator with external clock source */
  #define OSCILLATORS_XOSC32KI_BYPASS_ResetValue (0x00000000UL) /*!< Reset value of BYPASS register.                           */

/* BYPASS @Bit 0 : Enable or disable bypass of LFCLK crystal oscillator with external clock source */
  #define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Pos (0UL) /*!< Position of BYPASS field.                                          */
  #define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Msk (0x1UL << OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS
                                                                            field.*/
  #define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Min (0x0UL) /*!< Min enumerator value of BYPASS field.                            */
  #define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Max (0x1UL) /*!< Max enumerator value of BYPASS field.                            */
  #define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Disabled (0x0UL) /*!< Disable (use crystal)                                       */
  #define OSCILLATORS_XOSC32KI_BYPASS_BYPASS_Enabled (0x1UL) /*!< Enable (use rail-to-rail external source)                    */


/* OSCILLATORS_XOSC32KI_INTCAP: Programmable capacitance of XL1 and XL2 */
  #define OSCILLATORS_XOSC32KI_INTCAP_ResetValue (0x00000017UL) /*!< Reset value of INTCAP register.                           */

/* VAL @Bits 0..4 : Crystal load capacitor as seen by the crystal across its terminals, including pin capacitance but excluding
                    PCB stray capacitance. */

  #define OSCILLATORS_XOSC32KI_INTCAP_VAL_Pos (0UL)  /*!< Position of VAL field.                                               */
  #define OSCILLATORS_XOSC32KI_INTCAP_VAL_Msk (0x1FUL << OSCILLATORS_XOSC32KI_INTCAP_VAL_Pos) /*!< Bit mask of VAL field.      */


/* OSCILLATORS_XOSC32KI_STATUS: Status information */
  #define OSCILLATORS_XOSC32KI_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                           */

/* CLOCKRUNNING @Bit 2 : Clock status */
  #define OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_Pos (2UL) /*!< Position of CLOCKRUNNING field.                              */
  #define OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_Msk (0x1UL << OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_Pos) /*!< Bit mask of
                                                                            CLOCKRUNNING field.*/
  #define OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_Min (0x0UL) /*!< Min enumerator value of CLOCKRUNNING field.                */
  #define OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_Max (0x1UL) /*!< Max enumerator value of CLOCKRUNNING field.                */
  #define OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_NotRunning (0x0UL) /*!< Clock is not running.                               */
  #define OSCILLATORS_XOSC32KI_STATUS_CLOCKRUNNING_Running (0x1UL) /*!< Clock is running.                                      */


