NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* AUXDATADMAEND @Bit 16 : Write '1' to enable interrupt for event AUXDATADMAEND */
  #define RADIO_INTENSET11_AUXDATADMAEND_Pos (16UL)  /*!< Position of AUXDATADMAEND field.                                     */
  #define RADIO_INTENSET11_AUXDATADMAEND_Msk (0x1UL << RADIO_INTENSET11_AUXDATADMAEND_Pos) /*!< Bit mask of AUXDATADMAEND
                                                                            field.*/
  #define RADIO_INTENSET11_AUXDATADMAEND_Min (0x0UL) /*!< Min enumerator value of AUXDATADMAEND field.                         */
  #define RADIO_INTENSET11_AUXDATADMAEND_Max (0x1UL) /*!< Max enumerator value of AUXDATADMAEND field.                         */
  #define RADIO_INTENSET11_AUXDATADMAEND_Set (0x1UL) /*!< Enable                                                               */
  #define RADIO_INTENSET11_AUXDATADMAEND_Disabled (0x0UL) /*!< Read: Disabled                                                  */
  #define RADIO_INTENSET11_AUXDATADMAEND_Enabled (0x1UL) /*!< Read: Enabled                                                    */

/* CSTONESEND @Bit 18 : Write '1' to enable interrupt for event CSTONESEND */
  #define RADIO_INTENSET11_CSTONESEND_Pos (18UL)     /*!< Position of CSTONESEND field.                                        */
  #define RADIO_INTENSET11_CSTONESEND_Msk (0x1UL << RADIO_INTENSET11_CSTONESEND_Pos) /*!< Bit mask of CSTONESEND field.        */
  #define RADIO_INTENSET11_CSTONESEND_Min (0x0UL)    /*!< Min enumerator value of CSTONESEND field.                            */
  #define RADIO_INTENSET11_CSTONESEND_Max (0x1UL)    /*!< Max enumerator value of CSTONESEND field.                            */
  #define RADIO_INTENSET11_CSTONESEND_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET11_CSTONESEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET11_CSTONESEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* RADIO_INTENCLR10: Disable interrupt */
  #define RADIO_INTENCLR10_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR10 register.                                  */

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define RADIO_INTENCLR10_READY_Pos (0UL)           /*!< Position of READY field.                                             */
  #define RADIO_INTENCLR10_READY_Msk (0x1UL << RADIO_INTENCLR10_READY_Pos) /*!< Bit mask of READY field.                       */
  #define RADIO_INTENCLR10_READY_Min (0x0UL)         /*!< Min enumerator value of READY field.                                 */
  #define RADIO_INTENCLR10_READY_Max (0x1UL)         /*!< Max enumerator value of READY field.                                 */
  #define RADIO_INTENCLR10_READY_Clear (0x1UL)       /*!< Disable                                                              */
  #define RADIO_INTENCLR10_READY_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_READY_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* TXREADY @Bit 1 : Write '1' to disable interrupt for event TXREADY */
  #define RADIO_INTENCLR10_TXREADY_Pos (1UL)         /*!< Position of TXREADY field.                                           */
  #define RADIO_INTENCLR10_TXREADY_Msk (0x1UL << RADIO_INTENCLR10_TXREADY_Pos) /*!< Bit mask of TXREADY field.                 */
  #define RADIO_INTENCLR10_TXREADY_Min (0x0UL)       /*!< Min enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR10_TXREADY_Max (0x1UL)       /*!< Max enumerator value of TXREADY field.                               */
  #define RADIO_INTENCLR10_TXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_TXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_TXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXREADY @Bit 2 : Write '1' to disable interrupt for event RXREADY */
  #define RADIO_INTENCLR10_RXREADY_Pos (2UL)         /*!< Position of RXREADY field.                                           */
  #define RADIO_INTENCLR10_RXREADY_Msk (0x1UL << RADIO_INTENCLR10_RXREADY_Pos) /*!< Bit mask of RXREADY field.                 */
  #define RADIO_INTENCLR10_RXREADY_Min (0x0UL)       /*!< Min enumerator value of RXREADY field.                               */
  #define RADIO_INTENCLR10_RXREADY_Max (0x1UL)       /*!< Max enumerator value of RXREADY field.                               */
  #define RADIO_INTENCLR10_RXREADY_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_RXREADY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_RXREADY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ADDRESS @Bit 3 : Write '1' to disable interrupt for event ADDRESS */
  #define RADIO_INTENCLR10_ADDRESS_Pos (3UL)         /*!< Position of ADDRESS field.                                           */
  #define RADIO_INTENCLR10_ADDRESS_Msk (0x1UL << RADIO_INTENCLR10_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                 */
  #define RADIO_INTENCLR10_ADDRESS_Min (0x0UL)       /*!< Min enumerator value of ADDRESS field.                               */
  #define RADIO_INTENCLR10_ADDRESS_Max (0x1UL)       /*!< Max enumerator value of ADDRESS field.                               */
  #define RADIO_INTENCLR10_ADDRESS_Clear (0x1UL)     /*!< Disable                                                              */
  #define RADIO_INTENCLR10_ADDRESS_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENCLR10_ADDRESS_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

