NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* RRAMC_POWER_STANDBYCONFIG: Standby mode configuration */
  #define RRAMC_POWER_STANDBYCONFIG_ResetValue (0x00000000UL) /*!< Reset value of STANDBYCONFIG register.                      */

/* MODE @Bits 0..1 : RRAM standby mode */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Pos (0UL)   /*!< Position of MODE field.                                              */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Msk (0x3UL << RRAMC_POWER_STANDBYCONFIG_MODE_Pos) /*!< Bit mask of MODE field.        */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                  */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Max (0x3UL) /*!< Max enumerator value of MODE field.                                  */
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Normal (0x0UL) /*!< The RRAM automatically goes into idle mode while the RRAM is not
                                                             being accessed*/
  #define RRAMC_POWER_STANDBYCONFIG_MODE_NAP (0x1UL) /*!< The RRAM goes into NAP mode when the access timeout counter is
                                                          expired*/
  #define RRAMC_POWER_STANDBYCONFIG_MODE_PowerDown (0x2UL) /*!< The RRAM goes into power down mode when the access timeout
                                                                counter is expired*/
  #define RRAMC_POWER_STANDBYCONFIG_MODE_Standby (0x3UL) /*!< The RRAM remains active while the RRAM is not being accessed.    */


/* RRAMC_POWER_LOWPOWERCONFIG: Low power mode configuration */
  #define RRAMC_POWER_LOWPOWERCONFIG_ResetValue (0x00000000UL) /*!< Reset value of LOWPOWERCONFIG register.                    */

/* MODE @Bits 0..1 : RRAM low power mode */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Pos (0UL)  /*!< Position of MODE field.                                              */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Msk (0x3UL << RRAMC_POWER_LOWPOWERCONFIG_MODE_Pos) /*!< Bit mask of MODE field.      */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                                 */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Max (0x3UL) /*!< Max enumerator value of MODE field.                                 */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_PowerDown (0x0UL) /*!< The RRAM goes into power down mode                            */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_Standby (0x1UL) /*!< The RRAM automatically goes into standby mode while the RRAM is
                                                               not being accessed*/
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_NAP (0x2UL) /*!< The RRAM goes into NAP mode                                         */
  #define RRAMC_POWER_LOWPOWERCONFIG_MODE_PowerOff (0x3UL) /*!< The RRAM is powered Off                                        */



/* =================================================== Struct RRAMC_ERASE ==================================================== */
/**
  * @brief ERASE [RRAMC_ERASE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ERASEALL;                          /*!< (@ 0x00000000) Erase RRAM, including UICR All information in SICR,
                                                                         including keys, are also erased*/
} NRF_RRAMC_ERASE_Type;                              /*!< Size = 4 (0x004)                                                     */

/* RRAMC_ERASE_ERASEALL: Erase RRAM, including UICR All information in SICR, including keys, are also erased */
  #define RRAMC_ERASE_ERASEALL_ResetValue (0x00000000UL) /*!< Reset value of ERASEALL register.                                */

/* ERASE @Bit 0 : Erase RRAM */
  #define RRAMC_ERASE_ERASEALL_ERASE_Pos (0UL)       /*!< Position of ERASE field.                                             */
  #define RRAMC_ERASE_ERASEALL_ERASE_Msk (0x1UL << RRAMC_ERASE_ERASEALL_ERASE_Pos) /*!< Bit mask of ERASE field.               */
  #define RRAMC_ERASE_ERASEALL_ERASE_Min (0x0UL)     /*!< Min enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_Max (0x1UL)     /*!< Max enumerator value of ERASE field.                                 */
  #define RRAMC_ERASE_ERASEALL_ERASE_NoOperation (0x0UL) /*!< No operation                                                     */
  #define RRAMC_ERASE_ERASEALL_ERASE_Erase (0x1UL)   /*!< Start erase of chip                                                  */



/* =================================================== Struct RRAMC_REGION =================================================== */
/**
  * @brief REGION [RRAMC_REGION] RRAMC can apply access privileges to regions of the RRAM. Some regions are dedicated for system
            use and are not available for configuration - refer to the instantiation table for details.

  */
typedef struct {
  __IOM uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Region address                                        */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000004) Region configuration                                  */
} NRF_RRAMC_REGION_Type;                             /*!< Size = 8 (0x008)                                                     */
  #define RRAMC_REGION_MaxCount (6UL)                /*!< Size of REGION[6] array.                                             */
  #define RRAMC_REGION_MaxIndex (5UL)                /*!< Max index of REGION[6] array.                                        */
  #define RRAMC_REGION_MinIndex (0UL)                /*!< Min index of REGION[6] array.                                        */

/* RRAMC_REGION_ADDRESS: Region address */
  #define RRAMC_REGION_ADDRESS_ResetValue (0x00000000UL) /*!< Reset value of ADDRESS register.                                 */

/* STARTADDR @Bits 0..31 : Start address of the region [n] */
  #define RRAMC_REGION_ADDRESS_STARTADDR_Pos (0UL)   /*!< Position of STARTADDR field.                                         */
  #define RRAMC_REGION_ADDRESS_STARTADDR_Msk (0xFFFFFFFFUL << RRAMC_REGION_ADDRESS_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* RRAMC_REGION_CONFIG: Region configuration */
  #define RRAMC_REGION_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                   */

/* READ @Bit 0 : Read access */
  #define RRAMC_REGION_CONFIG_READ_Pos (0UL)         /*!< Position of READ field.                                              */
  #define RRAMC_REGION_CONFIG_READ_Msk (0x1UL << RRAMC_REGION_CONFIG_READ_Pos) /*!< Bit mask of READ field.                    */
  #define RRAMC_REGION_CONFIG_READ_Min (0x0UL)       /*!< Min enumerator value of READ field.                                  */
  #define RRAMC_REGION_CONFIG_READ_Max (0x1UL)       /*!< Max enumerator value of READ field.                                  */
  #define RRAMC_REGION_CONFIG_READ_NotAllowed (0x0UL) /*!< Read access to override region [n] is not allowed                   */
  #define RRAMC_REGION_CONFIG_READ_Allowed (0x1UL)   /*!< Read access to override region [n] is allowed                        */

