NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* UARTE_PUBLISH_DMA_RX_BUSERROR: Publish configuration for event BUSERROR */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                          */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                      */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                       */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Pos (31UL) /*!< Position of EN field.                                               */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Pos) /*!< Bit mask of EN field.      */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                  */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                  */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                            */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                              */


/* UARTE_PUBLISH_DMA_RX_MATCH: Publish configuration for event MATCH[n] */
  #define UARTE_PUBLISH_DMA_RX_MATCH_MaxCount (4UL)  /*!< Max size of MATCH[4] array.                                          */
  #define UARTE_PUBLISH_DMA_RX_MATCH_MaxIndex (3UL)  /*!< Max index of MATCH[4] array.                                         */
  #define UARTE_PUBLISH_DMA_RX_MATCH_MinIndex (0UL)  /*!< Min index of MATCH[4] array.                                         */
  #define UARTE_PUBLISH_DMA_RX_MATCH_ResetValue (0x00000000UL) /*!< Reset value of MATCH[4] register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event MATCH[n] will publish to */
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_MATCH_EN_Pos) /*!< Bit mask of EN field.            */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */



/* =============================================== Struct UARTE_PUBLISH_DMA_TX =============================================== */
/**
  * @brief TX [UARTE_PUBLISH_DMA_TX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Publish configuration for event END                   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Publish configuration for event READY                 */
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) Publish configuration for event BUSERROR              */
} NRF_UARTE_PUBLISH_DMA_TX_Type;                     /*!< Size = 12 (0x00C)                                                    */

/* UARTE_PUBLISH_DMA_TX_END: Publish configuration for event END */
  #define UARTE_PUBLISH_DMA_TX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_TX_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_TX_END_EN_Pos) /*!< Bit mask of EN field.                */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


