NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define UARTE_INTEN_DMARXMATCH2_Pos (24UL)         /*!< Position of DMARXMATCH2 field.                                       */
  #define UARTE_INTEN_DMARXMATCH2_Msk (0x1UL << UARTE_INTEN_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.               */
  #define UARTE_INTEN_DMARXMATCH2_Min (0x0UL)        /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define UARTE_INTEN_DMARXMATCH2_Max (0x1UL)        /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define UARTE_INTEN_DMARXMATCH2_Disabled (0x0UL)   /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXMATCH2_Enabled (0x1UL)    /*!< Enable                                                               */

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define UARTE_INTEN_DMARXMATCH3_Pos (25UL)         /*!< Position of DMARXMATCH3 field.                                       */
  #define UARTE_INTEN_DMARXMATCH3_Msk (0x1UL << UARTE_INTEN_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.               */
  #define UARTE_INTEN_DMARXMATCH3_Min (0x0UL)        /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define UARTE_INTEN_DMARXMATCH3_Max (0x1UL)        /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define UARTE_INTEN_DMARXMATCH3_Disabled (0x0UL)   /*!< Disable                                                              */
  #define UARTE_INTEN_DMARXMATCH3_Enabled (0x1UL)    /*!< Enable                                                               */

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define UARTE_INTEN_DMATXEND_Pos (26UL)            /*!< Position of DMATXEND field.                                          */
  #define UARTE_INTEN_DMATXEND_Msk (0x1UL << UARTE_INTEN_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                        */
  #define UARTE_INTEN_DMATXEND_Min (0x0UL)           /*!< Min enumerator value of DMATXEND field.                              */
  #define UARTE_INTEN_DMATXEND_Max (0x1UL)           /*!< Max enumerator value of DMATXEND field.                              */
  #define UARTE_INTEN_DMATXEND_Disabled (0x0UL)      /*!< Disable                                                              */
  #define UARTE_INTEN_DMATXEND_Enabled (0x1UL)       /*!< Enable                                                               */

/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define UARTE_INTEN_DMATXREADY_Pos (27UL)          /*!< Position of DMATXREADY field.                                        */
  #define UARTE_INTEN_DMATXREADY_Msk (0x1UL << UARTE_INTEN_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.                  */
  #define UARTE_INTEN_DMATXREADY_Min (0x0UL)         /*!< Min enumerator value of DMATXREADY field.                            */
  #define UARTE_INTEN_DMATXREADY_Max (0x1UL)         /*!< Max enumerator value of DMATXREADY field.                            */
  #define UARTE_INTEN_DMATXREADY_Disabled (0x0UL)    /*!< Disable                                                              */
  #define UARTE_INTEN_DMATXREADY_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define UARTE_INTEN_DMATXBUSERROR_Pos (28UL)       /*!< Position of DMATXBUSERROR field.                                     */
  #define UARTE_INTEN_DMATXBUSERROR_Msk (0x1UL << UARTE_INTEN_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.         */
  #define UARTE_INTEN_DMATXBUSERROR_Min (0x0UL)      /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define UARTE_INTEN_DMATXBUSERROR_Max (0x1UL)      /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define UARTE_INTEN_DMATXBUSERROR_Disabled (0x0UL) /*!< Disable                                                              */
  #define UARTE_INTEN_DMATXBUSERROR_Enabled (0x1UL)  /*!< Enable                                                               */

/* FRAMETIMEOUT @Bit 29 : Enable or disable interrupt for event FRAMETIMEOUT */
  #define UARTE_INTEN_FRAMETIMEOUT_Pos (29UL)        /*!< Position of FRAMETIMEOUT field.                                      */
  #define UARTE_INTEN_FRAMETIMEOUT_Msk (0x1UL << UARTE_INTEN_FRAMETIMEOUT_Pos) /*!< Bit mask of FRAMETIMEOUT field.            */
  #define UARTE_INTEN_FRAMETIMEOUT_Min (0x0UL)       /*!< Min enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_INTEN_FRAMETIMEOUT_Max (0x1UL)       /*!< Max enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_INTEN_FRAMETIMEOUT_Disabled (0x0UL)  /*!< Disable                                                              */
  #define UARTE_INTEN_FRAMETIMEOUT_Enabled (0x1UL)   /*!< Enable                                                               */


/* UARTE_INTENSET: Enable interrupt */
  #define UARTE_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* CTS @Bit 0 : Write '1' to enable interrupt for event CTS */
  #define UARTE_INTENSET_CTS_Pos (0UL)               /*!< Position of CTS field.                                               */
  #define UARTE_INTENSET_CTS_Msk (0x1UL << UARTE_INTENSET_CTS_Pos) /*!< Bit mask of CTS field.                                 */
  #define UARTE_INTENSET_CTS_Min (0x0UL)             /*!< Min enumerator value of CTS field.                                   */
  #define UARTE_INTENSET_CTS_Max (0x1UL)             /*!< Max enumerator value of CTS field.                                   */
  #define UARTE_INTENSET_CTS_Set (0x1UL)             /*!< Enable                                                               */
  #define UARTE_INTENSET_CTS_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_CTS_Enabled (0x1UL)         /*!< Read: Enabled                                                        */

/* NCTS @Bit 1 : Write '1' to enable interrupt for event NCTS */
  #define UARTE_INTENSET_NCTS_Pos (1UL)              /*!< Position of NCTS field.                                              */
  #define UARTE_INTENSET_NCTS_Msk (0x1UL << UARTE_INTENSET_NCTS_Pos) /*!< Bit mask of NCTS field.                              */
  #define UARTE_INTENSET_NCTS_Min (0x0UL)            /*!< Min enumerator value of NCTS field.                                  */
  #define UARTE_INTENSET_NCTS_Max (0x1UL)            /*!< Max enumerator value of NCTS field.                                  */
  #define UARTE_INTENSET_NCTS_Set (0x1UL)            /*!< Enable                                                               */
  #define UARTE_INTENSET_NCTS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_NCTS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* TXDRDY @Bit 3 : Write '1' to enable interrupt for event TXDRDY */
  #define UARTE_INTENSET_TXDRDY_Pos (3UL)            /*!< Position of TXDRDY field.                                            */
  #define UARTE_INTENSET_TXDRDY_Msk (0x1UL << UARTE_INTENSET_TXDRDY_Pos) /*!< Bit mask of TXDRDY field.                        */
  #define UARTE_INTENSET_TXDRDY_Min (0x0UL)          /*!< Min enumerator value of TXDRDY field.                                */
  #define UARTE_INTENSET_TXDRDY_Max (0x1UL)          /*!< Max enumerator value of TXDRDY field.                                */
  #define UARTE_INTENSET_TXDRDY_Set (0x1UL)          /*!< Enable                                                               */
  #define UARTE_INTENSET_TXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_TXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* RXDRDY @Bit 4 : Write '1' to enable interrupt for event RXDRDY */
  #define UARTE_INTENSET_RXDRDY_Pos (4UL)            /*!< Position of RXDRDY field.                                            */
  #define UARTE_INTENSET_RXDRDY_Msk (0x1UL << UARTE_INTENSET_RXDRDY_Pos) /*!< Bit mask of RXDRDY field.                        */
  #define UARTE_INTENSET_RXDRDY_Min (0x0UL)          /*!< Min enumerator value of RXDRDY field.                                */
  #define UARTE_INTENSET_RXDRDY_Max (0x1UL)          /*!< Max enumerator value of RXDRDY field.                                */
  #define UARTE_INTENSET_RXDRDY_Set (0x1UL)          /*!< Enable                                                               */
  #define UARTE_INTENSET_RXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENSET_RXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

