NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* NCTS @Bit 1 : Write '1' to disable interrupt for event NCTS */
  #define UARTE_INTENCLR_NCTS_Pos (1UL)              /*!< Position of NCTS field.                                              */
  #define UARTE_INTENCLR_NCTS_Msk (0x1UL << UARTE_INTENCLR_NCTS_Pos) /*!< Bit mask of NCTS field.                              */
  #define UARTE_INTENCLR_NCTS_Min (0x0UL)            /*!< Min enumerator value of NCTS field.                                  */
  #define UARTE_INTENCLR_NCTS_Max (0x1UL)            /*!< Max enumerator value of NCTS field.                                  */
  #define UARTE_INTENCLR_NCTS_Clear (0x1UL)          /*!< Disable                                                              */
  #define UARTE_INTENCLR_NCTS_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_NCTS_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* TXDRDY @Bit 3 : Write '1' to disable interrupt for event TXDRDY */
  #define UARTE_INTENCLR_TXDRDY_Pos (3UL)            /*!< Position of TXDRDY field.                                            */
  #define UARTE_INTENCLR_TXDRDY_Msk (0x1UL << UARTE_INTENCLR_TXDRDY_Pos) /*!< Bit mask of TXDRDY field.                        */
  #define UARTE_INTENCLR_TXDRDY_Min (0x0UL)          /*!< Min enumerator value of TXDRDY field.                                */
  #define UARTE_INTENCLR_TXDRDY_Max (0x1UL)          /*!< Max enumerator value of TXDRDY field.                                */
  #define UARTE_INTENCLR_TXDRDY_Clear (0x1UL)        /*!< Disable                                                              */
  #define UARTE_INTENCLR_TXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_TXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* RXDRDY @Bit 4 : Write '1' to disable interrupt for event RXDRDY */
  #define UARTE_INTENCLR_RXDRDY_Pos (4UL)            /*!< Position of RXDRDY field.                                            */
  #define UARTE_INTENCLR_RXDRDY_Msk (0x1UL << UARTE_INTENCLR_RXDRDY_Pos) /*!< Bit mask of RXDRDY field.                        */
  #define UARTE_INTENCLR_RXDRDY_Min (0x0UL)          /*!< Min enumerator value of RXDRDY field.                                */
  #define UARTE_INTENCLR_RXDRDY_Max (0x1UL)          /*!< Max enumerator value of RXDRDY field.                                */
  #define UARTE_INTENCLR_RXDRDY_Clear (0x1UL)        /*!< Disable                                                              */
  #define UARTE_INTENCLR_RXDRDY_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_RXDRDY_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to disable interrupt for event ERROR */
  #define UARTE_INTENCLR_ERROR_Pos (5UL)             /*!< Position of ERROR field.                                             */
  #define UARTE_INTENCLR_ERROR_Msk (0x1UL << UARTE_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                           */
  #define UARTE_INTENCLR_ERROR_Min (0x0UL)           /*!< Min enumerator value of ERROR field.                                 */
  #define UARTE_INTENCLR_ERROR_Max (0x1UL)           /*!< Max enumerator value of ERROR field.                                 */
  #define UARTE_INTENCLR_ERROR_Clear (0x1UL)         /*!< Disable                                                              */
  #define UARTE_INTENCLR_ERROR_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_ERROR_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* RXTO @Bit 9 : Write '1' to disable interrupt for event RXTO */
  #define UARTE_INTENCLR_RXTO_Pos (9UL)              /*!< Position of RXTO field.                                              */
  #define UARTE_INTENCLR_RXTO_Msk (0x1UL << UARTE_INTENCLR_RXTO_Pos) /*!< Bit mask of RXTO field.                              */
  #define UARTE_INTENCLR_RXTO_Min (0x0UL)            /*!< Min enumerator value of RXTO field.                                  */
  #define UARTE_INTENCLR_RXTO_Max (0x1UL)            /*!< Max enumerator value of RXTO field.                                  */
  #define UARTE_INTENCLR_RXTO_Clear (0x1UL)          /*!< Disable                                                              */
  #define UARTE_INTENCLR_RXTO_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_RXTO_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* TXSTOPPED @Bit 12 : Write '1' to disable interrupt for event TXSTOPPED */
  #define UARTE_INTENCLR_TXSTOPPED_Pos (12UL)        /*!< Position of TXSTOPPED field.                                         */
  #define UARTE_INTENCLR_TXSTOPPED_Msk (0x1UL << UARTE_INTENCLR_TXSTOPPED_Pos) /*!< Bit mask of TXSTOPPED field.               */
  #define UARTE_INTENCLR_TXSTOPPED_Min (0x0UL)       /*!< Min enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENCLR_TXSTOPPED_Max (0x1UL)       /*!< Max enumerator value of TXSTOPPED field.                             */
  #define UARTE_INTENCLR_TXSTOPPED_Clear (0x1UL)     /*!< Disable                                                              */
  #define UARTE_INTENCLR_TXSTOPPED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_TXSTOPPED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define UARTE_INTENCLR_DMARXEND_Pos (19UL)         /*!< Position of DMARXEND field.                                          */
  #define UARTE_INTENCLR_DMARXEND_Msk (0x1UL << UARTE_INTENCLR_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                  */
  #define UARTE_INTENCLR_DMARXEND_Min (0x0UL)        /*!< Min enumerator value of DMARXEND field.                              */
  #define UARTE_INTENCLR_DMARXEND_Max (0x1UL)        /*!< Max enumerator value of DMARXEND field.                              */
  #define UARTE_INTENCLR_DMARXEND_Clear (0x1UL)      /*!< Disable                                                              */
  #define UARTE_INTENCLR_DMARXEND_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define UARTE_INTENCLR_DMARXEND_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

