NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
/* VPR_CPURUN: State of the CPU after a core reset */
  #define VPR_CPURUN_ResetValue (0x00000000UL)       /*!< Reset value of CPURUN register.                                      */

/* EN @Bit 0 : Controls CPU running state after a core reset. */
  #define VPR_CPURUN_EN_Pos (0UL)                    /*!< Position of EN field.                                                */
  #define VPR_CPURUN_EN_Msk (0x1UL << VPR_CPURUN_EN_Pos) /*!< Bit mask of EN field.                                            */
  #define VPR_CPURUN_EN_Min (0x0UL)                  /*!< Min enumerator value of EN field.                                    */
  #define VPR_CPURUN_EN_Max (0x1UL)                  /*!< Max enumerator value of EN field.                                    */
  #define VPR_CPURUN_EN_Stopped (0x0UL)              /*!< CPU stopped. If this is the CPU state after a core reset, setting this
                                                          bit will change the CPU state to CPU running.*/
  #define VPR_CPURUN_EN_Running (0x1UL)              /*!< CPU running. If this is the CPU state after a core reset, clearing
                                                          this bit will change the CPU state to CPU stopped after a core reset.*/


/* VPR_VPRSTATUS: VPR state information. */
  #define VPR_VPRSTATUS_ResetValue (0x00000000UL)    /*!< Reset value of VPRSTATUS register.                                   */

/* CPUSTATUS @Bits 0..3 : Enumerates one of several possible states for the VPR: */
  #define VPR_VPRSTATUS_CPUSTATUS_Pos (0UL)          /*!< Position of CPUSTATUS field.                                         */
  #define VPR_VPRSTATUS_CPUSTATUS_Msk (0xFUL << VPR_VPRSTATUS_CPUSTATUS_Pos) /*!< Bit mask of CPUSTATUS field.                 */
  #define VPR_VPRSTATUS_CPUSTATUS_Min (0x0UL)        /*!< Min enumerator value of CPUSTATUS field.                             */
  #define VPR_VPRSTATUS_CPUSTATUS_Max (0xEUL)        /*!< Max enumerator value of CPUSTATUS field.                             */
  #define VPR_VPRSTATUS_CPUSTATUS_WAITING (0x0UL)    /*!< WAITING (not yet started)                                            */
  #define VPR_VPRSTATUS_CPUSTATUS_RUNNING (0x1UL)    /*!< RUNNING                                                              */
  #define VPR_VPRSTATUS_CPUSTATUS_SLEEPING (0x2UL)   /*!< SLEEPING                                                             */
  #define VPR_VPRSTATUS_CPUSTATUS_INTERRUPT (0x3UL)  /*!< INTERRUPT (in handler)                                               */
  #define VPR_VPRSTATUS_CPUSTATUS_EXCEPTION_TRAP (0x4UL) /*!< EXCEPTION/TRAP (in handler)                                      */
  #define VPR_VPRSTATUS_CPUSTATUS_ONGOING_RESET (0x5UL) /*!< ONGOING_RESET                                                     */
  #define VPR_VPRSTATUS_CPUSTATUS_HALTED (0x6UL)     /*!< HALTED                                                               */
  #define VPR_VPRSTATUS_CPUSTATUS_ERROR (0xEUL)      /*!< ERROR (lockup, needs debugging or reset)                             */

/* RTPENABLED @Bit 4 : Mirrors the ENABLERTPERIPH bit in the NORDIC.VPRNORDICCTRL CSR */
  #define VPR_VPRSTATUS_RTPENABLED_Pos (4UL)         /*!< Position of RTPENABLED field.                                        */
  #define VPR_VPRSTATUS_RTPENABLED_Msk (0x1UL << VPR_VPRSTATUS_RTPENABLED_Pos) /*!< Bit mask of RTPENABLED field.              */
  #define VPR_VPRSTATUS_RTPENABLED_Min (0x0UL)       /*!< Min enumerator value of RTPENABLED field.                            */
  #define VPR_VPRSTATUS_RTPENABLED_Max (0x1UL)       /*!< Max enumerator value of RTPENABLED field.                            */
  #define VPR_VPRSTATUS_RTPENABLED_Disabled (0x0UL)  /*!< Real-time peripherals disabled                                       */
  #define VPR_VPRSTATUS_RTPENABLED_Enabled (0x1UL)   /*!< Real-time peripherals enabled                                        */

/* RTPSTALL @Bit 5 : Stalled waiting for real-time peripheral blocking CSR access, for example WAIT, OUTB with dirty status */
  #define VPR_VPRSTATUS_RTPSTALL_Pos (5UL)           /*!< Position of RTPSTALL field.                                          */
  #define VPR_VPRSTATUS_RTPSTALL_Msk (0x1UL << VPR_VPRSTATUS_RTPSTALL_Pos) /*!< Bit mask of RTPSTALL field.                    */
  #define VPR_VPRSTATUS_RTPSTALL_Min (0x0UL)         /*!< Min enumerator value of RTPSTALL field.                              */
  #define VPR_VPRSTATUS_RTPSTALL_Max (0x1UL)         /*!< Max enumerator value of RTPSTALL field.                              */
  #define VPR_VPRSTATUS_RTPSTALL_NotStalled (0x0UL)  /*!< CPU not stalled on blocing CSR access.                               */
  #define VPR_VPRSTATUS_RTPSTALL_Stalled (0x1UL)     /*!< CPU stalled on blocing CSR access.                                   */


/* VPR_INITPC: Initial value of the PC at CPU start. */
  #define VPR_INITPC_ResetValue (0x00000000UL)       /*!< Reset value of INITPC register.                                      */

/* INITPC @Bits 0..31 : Initial value of the PC at CPU start. */
  #define VPR_INITPC_INITPC_Pos (0UL)                /*!< Position of INITPC field.                                            */
  #define VPR_INITPC_INITPC_Msk (0xFFFFFFFFUL << VPR_INITPC_INITPC_Pos) /*!< Bit mask of INITPC field.                         */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VPRCSR                                          ================ */
/* =========================================================================================================================== */

/**
  * @brief VPR CSR registers
  */
/**
  * @brief  [VPRCSR] (unspecified)
  */

/**
  * @brief  [VPRCSR] (unspecified)
  */

/**
  * @brief MSTATUS [VPRCSR_MSTATUS] Machine Status
  */
  #define VPRCSR_MSTATUS (0x00000300ul)
  #define VPRCSR_MSTATUS_ResetValue (0x00001800UL)   /*!< Reset value of MSTATUS register.                                     */

/* MIE @Bit 3 : Global interrupt enable for machine privilege mode */
  #define VPRCSR_MSTATUS_MIE_Pos (3UL)               /*!< Position of MIE field.                                               */
  #define VPRCSR_MSTATUS_MIE_Msk (0x1UL << VPRCSR_MSTATUS_MIE_Pos) /*!< Bit mask of MIE field.                                 */
  #define VPRCSR_MSTATUS_MIE_Min (0x0UL)             /*!< Min enumerator value of MIE field.                                   */
  #define VPRCSR_MSTATUS_MIE_Max (0x1UL)             /*!< Max enumerator value of MIE field.                                   */
  #define VPRCSR_MSTATUS_MIE_Disabled (0x0UL)        /*!< (unspecified)                                                        */
  #define VPRCSR_MSTATUS_MIE_Enabled (0x1UL)         /*!< (unspecified)                                                        */

/* MPIE @Bit 7 : Exists to support nested traps. Value of the interrupt-enable bit active prior to the trap for machine
                 privilege mode */

