NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_types.h
  #define VPRCSR_MSTATUS_MPIE_Pos (7UL)              /*!< Position of MPIE field.                                              */
  #define VPRCSR_MSTATUS_MPIE_Msk (0x1UL << VPRCSR_MSTATUS_MPIE_Pos) /*!< Bit mask of MPIE field.                              */
  #define VPRCSR_MSTATUS_MPIE_Min (0x0UL)            /*!< Min enumerator value of MPIE field.                                  */
  #define VPRCSR_MSTATUS_MPIE_Max (0x1UL)            /*!< Max enumerator value of MPIE field.                                  */
  #define VPRCSR_MSTATUS_MPIE_Disabled (0x0UL)       /*!< (unspecified)                                                        */
  #define VPRCSR_MSTATUS_MPIE_Enabled (0x1UL)        /*!< (unspecified)                                                        */

/* MPP @Bits 11..12 : Exists to support nested traps. Value of the privlege mode prior to the trap for machine privilege mode */
  #define VPRCSR_MSTATUS_MPP_Pos (11UL)              /*!< Position of MPP field.                                               */
  #define VPRCSR_MSTATUS_MPP_Msk (0x3UL << VPRCSR_MSTATUS_MPP_Pos) /*!< Bit mask of MPP field.                                 */


/**
  * @brief MISA [VPRCSR_MISA] Machine ISA
  */
  #define VPRCSR_MISA (0x00000301ul)
  #define VPRCSR_MISA_ResetValue (0x40001016UL)      /*!< Reset value of MISA register.                                        */

/* A @Bit 0 : Atomic extension */
  #define VPRCSR_MISA_A_Pos (0UL)                    /*!< Position of A field.                                                 */
  #define VPRCSR_MISA_A_Msk (0x1UL << VPRCSR_MISA_A_Pos) /*!< Bit mask of A field.                                             */
  #define VPRCSR_MISA_A_Min (0x0UL)                  /*!< Min enumerator value of A field.                                     */
  #define VPRCSR_MISA_A_Max (0x1UL)                  /*!< Max enumerator value of A field.                                     */
  #define VPRCSR_MISA_A_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_A_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* B @Bit 1 : Bit-Manipulation extension */
  #define VPRCSR_MISA_B_Pos (1UL)                    /*!< Position of B field.                                                 */
  #define VPRCSR_MISA_B_Msk (0x1UL << VPRCSR_MISA_B_Pos) /*!< Bit mask of B field.                                             */
  #define VPRCSR_MISA_B_Min (0x0UL)                  /*!< Min enumerator value of B field.                                     */
  #define VPRCSR_MISA_B_Max (0x1UL)                  /*!< Max enumerator value of B field.                                     */
  #define VPRCSR_MISA_B_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_B_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* C @Bit 2 : Compressed extension */
  #define VPRCSR_MISA_C_Pos (2UL)                    /*!< Position of C field.                                                 */
  #define VPRCSR_MISA_C_Msk (0x1UL << VPRCSR_MISA_C_Pos) /*!< Bit mask of C field.                                             */
  #define VPRCSR_MISA_C_Min (0x0UL)                  /*!< Min enumerator value of C field.                                     */
  #define VPRCSR_MISA_C_Max (0x1UL)                  /*!< Max enumerator value of C field.                                     */
  #define VPRCSR_MISA_C_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_C_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* E @Bit 4 : RV32E/RV64E base ISA */
  #define VPRCSR_MISA_E_Pos (4UL)                    /*!< Position of E field.                                                 */
  #define VPRCSR_MISA_E_Msk (0x1UL << VPRCSR_MISA_E_Pos) /*!< Bit mask of E field.                                             */
  #define VPRCSR_MISA_E_Min (0x0UL)                  /*!< Min enumerator value of E field.                                     */
  #define VPRCSR_MISA_E_Max (0x1UL)                  /*!< Max enumerator value of E field.                                     */
  #define VPRCSR_MISA_E_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_E_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* I @Bit 8 : RV32I/64I/128I base ISA */
  #define VPRCSR_MISA_I_Pos (8UL)                    /*!< Position of I field.                                                 */
  #define VPRCSR_MISA_I_Msk (0x1UL << VPRCSR_MISA_I_Pos) /*!< Bit mask of I field.                                             */
  #define VPRCSR_MISA_I_Min (0x0UL)                  /*!< Min enumerator value of I field.                                     */
  #define VPRCSR_MISA_I_Max (0x1UL)                  /*!< Max enumerator value of I field.                                     */
  #define VPRCSR_MISA_I_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_I_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* M @Bit 12 : Integer Multiply/Divide extension */
  #define VPRCSR_MISA_M_Pos (12UL)                   /*!< Position of M field.                                                 */
  #define VPRCSR_MISA_M_Msk (0x1UL << VPRCSR_MISA_M_Pos) /*!< Bit mask of M field.                                             */
  #define VPRCSR_MISA_M_Min (0x0UL)                  /*!< Min enumerator value of M field.                                     */
  #define VPRCSR_MISA_M_Max (0x1UL)                  /*!< Max enumerator value of M field.                                     */
  #define VPRCSR_MISA_M_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_M_Enabled (0x1UL)              /*!< (unspecified)                                                        */

/* N @Bit 13 : User-level interrupts supported */
  #define VPRCSR_MISA_N_Pos (13UL)                   /*!< Position of N field.                                                 */
  #define VPRCSR_MISA_N_Msk (0x1UL << VPRCSR_MISA_N_Pos) /*!< Bit mask of N field.                                             */
  #define VPRCSR_MISA_N_Min (0x0UL)                  /*!< Min enumerator value of N field.                                     */
  #define VPRCSR_MISA_N_Max (0x1UL)                  /*!< Max enumerator value of N field.                                     */
  #define VPRCSR_MISA_N_Disabled (0x0UL)             /*!< (unspecified)                                                        */
  #define VPRCSR_MISA_N_Enabled (0x1UL)              /*!< (unspecified)                                                        */

